CherryUSB/cherryusb_esp32/examples/device/cherryusb_device_cdc/sdkconfig.defaults
# Choose esp32s3 for build test
CONFIG_IDF_TARGET="esp32s3"

# ESP CherryUSB
CONFIG_CHERRYUSBD_ENABLED=y
CONFIG_USBDEV_REQUEST_BUFFER_LEN=256
CONFIG_CHERRYUSBD_CDC_ENABLED=y
CONFIG_FREERTOS_HZ=1000
